app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["id", 666], ["updated_at", 2017-03-09 01:59:51 UTC], ["id", 2]]

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("author", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"